Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Note (InputLayer)               [(None, 48, 45)]     0                                            
__________________________________________________________________________________________________
Dynamic (InputLayer)            [(None, 48, 5)]      0                                            
__________________________________________________________________________________________________
Spanner (InputLayer)            [(None, 48, 2)]      0                                            
__________________________________________________________________________________________________
Slur (InputLayer)               [(None, 48, 1)]      0                                            
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 48, 53)       0           Note[0][0]                       
                                                                 Dynamic[0][0]                    
                                                                 Spanner[0][0]                    
                                                                 Slur[0][0]                       
__________________________________________________________________________________________________
lstm (LSTM)                     (None, 48, 512)      1159168     concatenate[0][0]                
__________________________________________________________________________________________________
dropout (Dropout)               (None, 48, 512)      0           lstm[0][0]                       
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 48, 512)      2099200     dropout[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 48, 512)      0           lstm_1[0][0]                     
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 512)          2099200     dropout_1[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 512)          0           lstm_2[0][0]                     
__________________________________________________________________________________________________
Note_o (Dense)                  (None, 45)           23085       dropout_2[0][0]                  
__________________________________________________________________________________________________
Dynamic_o (Dense)               (None, 5)            2565        dropout_2[0][0]                  
__________________________________________________________________________________________________
Spanner_o (Dense)               (None, 2)            1026        dropout_2[0][0]                  
__________________________________________________________________________________________________
Slur_o (Dense)                  (None, 1)            513         dropout_2[0][0]                  
==================================================================================================
Total params: 5,384,757
Trainable params: 5,384,757
Non-trainable params: 0
__________________________________________________________________________________________________
==================================================
Model Hyperparameter Summary:
==================================================
	LSTM layers: 3
	LSTM units: 512
	Dropout: 0.3
	Single label loss function: categorical_crossentropy
	Multi label loss function: N/a
	Optimiser: adam
==================================================
