Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Note (InputLayer)            [(None, 48, 45)]          0         
_________________________________________________________________
lstm (LSTM)                  (None, 48, 256)           309248    
_________________________________________________________________
dropout (Dropout)            (None, 48, 256)           0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 256)               525312    
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
Note_o (Dense)               (None, 45)                11565     
=================================================================
Total params: 846,125
Trainable params: 846,125
Non-trainable params: 0
_________________________________________________________________
==================================================
Model Hyperparameter Summary:
==================================================
	LSTM layers: 2
	LSTM units: 256
	Dropout: 0.2
	Single label loss function: categorical_crossentropy
	Multi label loss function: N/a
	Optimiser: adam
==================================================
